# -*- coding: utf-8 -*-
# !/usr/bin/env python3

main_menu = ['Главное меню',
             'Добавить контакт',
             'Удалить контакт',
             'Изменить контакт',
             'Найти контакт',
             'Показать все контакты',
             'Выйти']

change_menu = ['Меню',
               'Изменить номер',
               'Изменить ФИО']

search_menu = ['Meню',
               'Поиск по номеру',
               'Поиск по ФИО']

user_input_data = ['Введите ФИО (Иванов Иван Иванович)',
                   'Введите номер (+7 (123) 456-78-90)']

user_change_phone = ['Введите ФИО контакта, где нужно изменить телефон',
                     'Введите новый номер телефона']

user_change_name = ['Введите номер телефона, где нужно изменить ФИО контакта',
                    'Введите новые ФИО контакта']

user_search_phone = 'Введите номер телефона, который нужно найти (+7 (123) 456-78-90): '
user_search_name = 'Введите ФИО контакта, которые нужно найти (Иванов Иван Иванович): '

menu_input_error = 'Ошибка ввода! Введите число от 1 до {}: '

empty_phone_book = '\nТелефонная книга пуста...\n'
