# -*- coding: utf-8 -*-
# !/usr/bin/env python3


"""
Задача №1
Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто,
насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.
е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе не-
сколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение Винни-Пух вбивает в
программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все
не в порядке.Пример:

пара-ра-рам рам-пам-папам па-ра-па-дам
Парам пам-пам
"""

test = 'пара-ра-рам рам-пам-папам па-ра-па-дам'
vowels = 'аоиеёэыуюя'


x = test.split()
